/* ==========================================
   WEBSITE SETTINGS
========================================== */

const SETTINGS = {

    title: "Star Personality Quiz",

    totalQuestions: 5,

    loadingTime: 2000

};



/* ==========================================
   ZODIAC LIST
========================================== */

const ZODIACS = [

    "Aries",
    "Taurus",
    "Gemini",
    "Cancer",
    "Leo",
    "Virgo",
    "Libra",
    "Scorpio",
    "Sagittarius",
    "Capricorn",
    "Aquarius",
    "Pisces"

];



/* ==========================================
   QUESTIONS
========================================== */

const QUESTIONS = [

    {

        id:1,

        image:"images/questions/q1.jpg",

        title:"หลังจากที่คุณปรับกล้องโทรทรรศน์ให้เข้าที่แล้วขยับมันเพื่อมองหาดวงดาว คุณจะมองไปที่ดวงดาวไหนก่อน",

        answers:[

            {

                text:"ดาวที่ส่องสว่างโดดเด่นที่สุด",

                score:{
                    Leo:2,
                    Aries:1,
                    Sagittarius:1
                }

            },

            {

                text:"ดวงดาวที่ส่องแสงนุ่มนวล",

                score:{
                    Cancer:2,
                    Pisces:1,
                    Taurus:1
                }

            },

            {

                text:"กลุ่มดาวที่เรียงตัวเป็นลวดลาย",

                score:{
                    Gemini:1,
                    Virgo:1,
                    Aquarius:2
                }

            },

            {

                text:"ความมืดอันกว้างใหญ่ของจักรวาล",

                score:{
                    Scorpio:2,
                    Capricorn:1,
                    Libra:1
                }

            }

        ]

    },



    {

        id:2,

        image:"images/questions/q2.jpg",

        title:"เมื่อคุณเลื่อนกล้องไปที่ดวงดาวหมู่นั้นแล้ว คุณมองหาสิ่งใดเป็นอย่างแรก",

        answers:[

            {

                text:"ดวงดาวที่สว่างไสวที่สุด",

                score:{
                    Leo:2,
                    Aries:1,
                    Capricorn:1
                }

            },

            {

                text:"ดาวที่รวมตัวกันเป็นกลุ่มเล็กๆดูน่ารัก",

                score:{
                    Cancer:2,
                    Taurus:1,
                    Pisces:1
                }

            },

            {

                text:"ดาวดวงน้อยที่มีแสงริบหรี่",

                score:{
                    Scorpio:2,
                    Virgo:1,
                    Pisces:1
                }

            },

            {

                text:"ดวงดาวที่อยู่ท่ามกลางดวงดาวหมู่มาก แทบจะกลืนไปกับทุกดวง",

                score:{
                    Libra:2,
                    Aquarius:1,
                    Gemini:1
                }

            }

        ]

    },



    {

        id:3,

        image:"images/questions/q3.jpg",

        title:"ดวงดาวที่คุณเลือกนั้นกระพริบไหวเหมือนกำลังขานรับ แต่เพราะอะไรคือสาเหตุที่ทำให้คุณเลือกที่จะมองมัน",

        answers:[

            {

                text:"เพราะเป็นดวงดาวที่มีแสงสว่างที่มากที่สุด",

                score:{
                    Leo:2,
                    Aries:1,
                    Sagittarius:1
                }

            },

            {

                text:"เพราะว่ามันดูแตกต่างจากดาวดวงอื่นที่อยู่รอบๆ",

                score:{
                    Aquarius:2,
                    Gemini:1,
                    Scorpio:1
                }

            },

            {

                text:"เพราะดูโดดเด่นมากกว่าดาวดวงอื่น",

                score:{
                    Sagittarius:2,
                    Leo:1,
                    Aries:1
                }

            },

            {

                text:"เพราะรู้สึกว่ามันเหมาะกับตัวเอง",

                score:{
                    Cancer:2,
                    Pisces:1,
                    Taurus:1
                }

            }

        ]

    },



    {

        id:4,

        image:"images/questions/q4.jpg",

        title:"คุณจ้องดูดวงดาวนั้นอยู่นานพอสมควร ก่อนจะสังเกตเห็นว่ามีดวงดาวอีกดวงที่สว่างเด่นขึ้นมาอยู่ใกล้ๆดาวที่คุณกำลังมองอยู่",

        answers:[

            {

                text:"สนใจแต่ดาวดวงเดิมที่เลือกไว้แต่แรก",

                score:{
                    Taurus:2,
                    Capricorn:2
                }

            },

            {

                text:"หันความสนใจไปที่ดวงดาวใหม่ที่โผล่ขึ้นมา",

                score:{
                    Gemini:2,
                    Sagittarius:2
                }

            },

            {

                text:"หันมองดาวดวงใหม่ลังเลอยู่สักพักนึง แต่ก็หันกลับมาที่ดาวดวงเดิม",

                score:{
                    Libra:2,
                    Virgo:2
                }

            },

            {

                text:"หันกล้องหนีไปทางอื่นเลย ไม่มองทั้งสอง",

                score:{
                    Aquarius:2,
                    Scorpio:1,
                    Pisces:1
                }

            }

        ]

    },



    {

        id:5,

        image:"images/questions/q5.jpg",

        title:"คุณรู้สึกว่าใช้เวลาพอสมควรแต่ยังเห็นดวงดาวไม่ชัดสมใจ คุณจึงเลือกที่จะ",

        answers:[

            {

                text:"ซูมกล้องเข้าไปให้เห็นดาวชัดขึ้น",

                score:{
                    Virgo:2,
                    Scorpio:2
                }

            },

            {

                text:"ขยับซูมออก เผื่อว่าจะใกล้มากเกิน",

                score:{
                    Libra:2,
                    Aquarius:2
                }

            },

            {

                text:"เอนกล้องไปดานข้างอยู่ครั้งสองครั้ง",

                score:{
                    Gemini:2,
                    Sagittarius:2
                }

            },

            {

                text:"กดกล้องลงต่ำจนคล้ายว่าจะปิดกล้อง",

                score:{
                    Cancer:2,
                    Pisces:1,
                    Taurus:1
                }

            }

        ]

    }

];



/* ==========================================
   RESULTS
========================================== */

const RESULTS = {

    Aries:{

        image:"images/results/ราศีเมษ.png",
        title:"ราศีเมษ",
        tagline:"ผู้จุดประกายการเริ่มต้น",
        description:"ราศีเมษเป็นราศีแรกของจักรราศี เปรียบเสมือนวินาทีที่ดวงอาทิตย์ก้าวเข้าสู่ฤดูใบไม้ผลิ หลังผ่านความหนาวเย็นอันยาวนาน ธรรมชาติเริ่มผลิใบอีกครั้ง ทุกสิ่งเหมือนถูกปลุกให้ตื่นขึ้นจากการหลับใหล จึงไม่น่าแปลกที่เมษจะเป็นตัวแทนของ การกำเนิด การเริ่มต้น และความกล้าหาญ ผู้ที่เกิดภายใต้ราศีนี้มักมีจิตวิญญาณของนักบุกเบิก กล้าที่จะเริ่มต้นในสิ่งใหม่ และพร้อมก้าวไปข้างหน้าแม้เส้นทางจะยังไม่ชัดเจน เพราะสำหรับเมษแล้ว ทุกความสำเร็จล้วนเริ่มต้นจากการลงมือทำ"

    },

    Taurus:{

        image:"images/results/ราศีพฤษภ.png",
        title:"ราศีพฤษภ",
        tagline:"ผู้มั่นคงดั่งผืนดิน",
        description:"ราศีพฤษภเป็นราศีแห่งความมั่นคง ความอดทน และการเติบโตอย่างค่อยเป็นค่อยไป เปรียบเสมือนต้นไม้ที่หยั่งรากลึกลงในผืนดิน แม้จะไม่เติบโตอย่างรวดเร็ว แต่สามารถยืนหยัดผ่านทุกฤดูกาลได้อย่างมั่นคง พฤษภเชื่อว่าความสำเร็จไม่ได้เกิดจากความเร่งรีบ หากแต่เกิดจากความสม่ำเสมอและความพยายามที่ไม่หยุดยั้ง จึงเป็นราศีที่สะท้อนถึงความน่าเชื่อถือ ความซื่อสัตย์ และคุณค่าของการสร้างสิ่งที่ยั่งยืน"

    },

    Gemini:{

        image:"images/results/ราศีเมถุน.png",
        title:"ราศีเมถุน",
        tagline:"ผู้แสวงหาความรู้ไม่สิ้นสุด",
        description:"ราศีเมถุนเป็นตัวแทนของการสื่อสาร ความอยากรู้อยากเห็น และการเปิดรับสิ่งใหม่ เปรียบเสมือนสายลมที่พัดผ่านทุกแห่งเพื่อเก็บเกี่ยวเรื่องราวจากโลกกว้าง ผู้ที่เกิดภายใต้ราศีนี้มักมีความคิดรวดเร็ว ช่างสังเกต และพร้อมเรียนรู้จากทุกประสบการณ์ สำหรับเมถุน โลกทั้งใบคือห้องเรียนที่ไม่มีวันสิ้นสุด และทุกการพบเจอคือโอกาสในการเติบโตทางความคิด"

    },

    Cancer:{

        image:"images/results/ราศีกรกฎ.png",
        title:"ราศีกรกฎ",
        tagline:"ผู้โอบกอดด้วยความอบอุ่น",
        description:"ราศีกรกฎเป็นราศีแห่งความอบอุ่น ความผูกพัน และการดูแลผู้อื่น เปรียบเสมือนบ้านที่เปิดประตูต้อนรับผู้คนด้วยความรักและความเข้าใจ ผู้ที่มีพลังของกรกฎมักให้ความสำคัญกับครอบครัว มิตรภาพ และความทรงจำอันมีค่า แม้ภายนอกจะดูเข้มแข็งดั่งกระดองปู แต่ภายในกลับอ่อนโยนและเปี่ยมด้วยความเมตตา พร้อมปกป้องคนที่รักอย่างสุดหัวใจ"

    },

    Leo:{

        image:"images/results/ราศีสิงห์.png",
        title:"ราศีสิงห์",
        tagline:"ผู้เปล่งประกายดั่งดวงอาทิตย์",
        description:"ราศีสิงห์เปรียบเสมือนดวงอาทิตย์ที่ส่องสว่างอยู่ใจกลางท้องฟ้า เป็นตัวแทนของความมั่นใจ ความสร้างสรรค์ และภาวะผู้นำ ผู้ที่เกิดภายใต้ราศีนี้มักกล้าแสดงออก มีความภาคภูมิใจในตัวเอง และเชื่อว่าทุกคนต่างมีคุณค่าในแบบของตนเอง สิงห์ไม่ได้ต้องการเพียงการได้รับการยอมรับ แต่ยังต้องการเป็นแรงบันดาลใจให้ผู้อื่นค้นพบแสงสว่างของตนเองเช่นกัน"

    },

    Virgo:{

        image:"images/results/ราศีกันย์.png",
        title:"ราศีกันย์",
        tagline:"ผู้สมบูรณ์แบบในรายละเอียด",
        description:"ราศีกันย์เป็นตัวแทนของความละเอียด รอบคอบ และการพัฒนาสิ่งต่าง ๆ ให้ดียิ่งขึ้น เปรียบเสมือนช่างฝีมือผู้ค่อย ๆ ขัดเกลาผลงานจนสมบูรณ์แบบ ผู้ที่เกิดภายใต้ราศีนี้มักมองเห็นรายละเอียดที่คนอื่นมองข้าม และเชื่อว่าความสำเร็จเกิดจากการปรับปรุงทีละเล็กทีละน้อย กันย์จึงเป็นราศีที่สะท้อนถึงความรับผิดชอบ ความตั้งใจ และการช่วยเหลือผู้อื่นด้วยความจริงใจ"

    },

    Libra:{

        image:"images/results/ราศีตุลย์.png",
        title:"ราศีตุลย์",
        tagline:"ผู้สร้างสมดุลให้ทุกสิ่ง",
        description:"ราศีตุลย์เป็นสัญลักษณ์ของความยุติธรรม ความกลมกลืน และความสัมพันธ์ เปรียบเสมือนตราชั่งที่พยายามรักษาสมดุลระหว่างเหตุผลและความรู้สึก ผู้ที่เกิดภายใต้ราศีนี้มักมองโลกจากหลายมุม เปิดใจรับฟังความคิดเห็นที่แตกต่าง และให้คุณค่ากับการอยู่ร่วมกันอย่างสงบสุข ตุลย์เชื่อว่าความเข้าใจคือรากฐานของทุกความสัมพันธ์ที่ยั่งยืน"

    },

    Scorpio:{

        image:"images/results/ราศีพิจิก.png",
        title:"ราศีพิจิก",
        tagline:"ผู้ซ่อนพลังไว้ใต้ความเงียบ",
        description:"ราศีพิจิกเป็นราศีแห่งความลึกซึ้ง การเปลี่ยนแปลง และพลังภายใน เปรียบเสมือนสายน้ำลึกที่ภายนอกอาจดูสงบนิ่ง แต่ซ่อนพลังอันมหาศาลไว้ภายใน ผู้ที่เกิดภายใต้ราศีนี้มักมีความมุ่งมั่น จริงใจ และไม่หวั่นเกรงต่อการเปลี่ยนแปลง เพราะเชื่อว่าทุกจุดจบคือจุดเริ่มต้นของการเติบโตครั้งใหม่ พิจิกจึงเป็นสัญลักษณ์ของการเกิดใหม่และการค้นพบตัวตนที่แท้จริง"

    },

    Sagittarius:{

        image:"images/results/ราศีธนู.png",
        title:"ราศีธนู",
        tagline:"ผู้เดินทางสู่ขอบฟ้าใหม่",
        description:"ราศีธนูเป็นตัวแทนของการผจญภัย อิสรภาพ และการแสวงหาความรู้ เปรียบเสมือนนักเดินทางที่ออกสำรวจโลกด้วยหัวใจที่เปิดกว้าง ผู้ที่เกิดภายใต้ราศีนี้เชื่อว่าทุกการเดินทาง ไม่ว่าจะใกล้หรือไกล ล้วนมอบบทเรียนอันล้ำค่าให้กับชีวิต ธนูจึงไม่เพียงแสวงหาสถานที่ใหม่ ๆ แต่ยังค้นหาความจริง ความหมาย และมุมมองที่กว้างขึ้นของโลก"

    },

    Capricorn:{

        image:"images/results/ราศีมังกร.png",
        title:"ราศีมังกร",
        tagline:"ผู้ก้าวสู่ความสำเร็จอย่างมั่นคง",
        description:"ราศีมังกรเป็นสัญลักษณ์ของความรับผิดชอบ วินัย และความมุ่งมั่น เปรียบเสมือนนักปีนเขาที่ค่อย ๆ ก้าวขึ้นสู่ยอดเขาด้วยความอดทน แม้เส้นทางจะยากลำบากเพียงใด ผู้ที่เกิดภายใต้ราศีนี้เชื่อว่าความสำเร็จไม่ได้เกิดจากโชค แต่เกิดจากการลงมือทำอย่างต่อเนื่อง มังกรจึงเป็นตัวแทนของความเข้มแข็ง ความมั่นคง และความภาคภูมิใจในผลลัพธ์ที่ได้มาจากความพยายาม"

    },

    Aquarius:{

        image:"images/results/ราศีกุมภ์.png",
        title:"ราศีกุมภ์",
        tagline:"ผู้มองโลกผ่านมุมมองใหม่",
        description:"ราศีกุมภ์เป็นราศีแห่งนวัตกรรม ความคิดสร้างสรรค์ และอิสรภาพ เปรียบเสมือนผู้ถือน้ำที่หล่อเลี้ยงโลกด้วยแนวคิดใหม่ ๆ ผู้ที่เกิดภายใต้ราศีนี้มักกล้าคิดต่าง ไม่ยึดติดกับกรอบเดิม และเชื่อว่าการเปลี่ยนแปลงสามารถทำให้สังคมดีขึ้นได้ กุมภ์จึงเป็นสัญลักษณ์ของผู้มองเห็นอนาคตก่อนใคร และพร้อมแบ่งปันสิ่งดี ๆ ให้กับผู้คนรอบตัว"

    },

    Pisces:{

        image:"images/results/ราศีมีน.png",
        title:"ราศีมีน",
        tagline:"ผู้ล่องลอยในจินตนาการอันงดงาม",
        description:"ราศีมีนเป็นราศีสุดท้ายของจักรราศี เปรียบเสมือนมหาสมุทรที่รวบรวมเรื่องราวของทุกสายน้ำไว้ในที่เดียว เป็นตัวแทนของความเมตตา จินตนาการ และความเข้าใจในความรู้สึกของผู้อื่น ผู้ที่เกิดภายใต้ราศีนี้มักมีหัวใจอ่อนโยน เห็นอกเห็นใจ และสามารถเชื่อมโยงผู้คนผ่านศิลปะ ความฝัน และอารมณ์ได้อย่างลึกซึ้ง มีนจึงเป็นสัญลักษณ์ของการยอมรับ การให้อภัย และการเข้าใจความงดงามของชีวิตในทุกแง่มุม"

    }

};